# Git и GitHub

# -----------------------------------------

# репозиторий - папка проекта за которой следит git

# репозиторий может быть:

# Локальный - находится на вашем компьютере.
# Удаленный - находится на сервере в интернете.

# -----------------------------------------

# Commit (Коммит) - точка сохранения в git

# Коммит состоит из:
# id - уникальный шифр обозначающий точку сохранения для обращения к ней
# имя автора - кто создал коммит
# сообщение - короткое описание, того, что изменилось

# -----------------------------------------

# Индекс/Область файлов

# Staging area - зона, которую покрывает git

# git add

# git commit

# -----------------------------------------

# Дерево и ветки (branch)

# Дерево - вся история сохранений в git

# Branch (ветка) - отдельное сохранения в git

# -----------------------------------------

# Команды git

# git init - создай новый репозиторий git

# git status - проверить состояние файлов.

# git add - добавить файлы в staging area

# git rm - удаление файла из staging area

# git commit - создать новое коммит (можно добавить -m для написания сообщения в коммите)

# git log - показывает список всех коммитов